//=============================================================================
/**
 *
 * VA-300プログラム
 * <<パラメータ関連モジュール>>
 *
 *	@brief パラメータアクセス用。
 *	
 *	@file prm_func.c
 *	
 *	@date	2012/08/29
 *	@version 1.00 新規作成
 *	@author	F.Saeki
 *
 *	Copyright (C) 2012, OYO Electric Corporation
 */
//=============================================================================
#include <machine.h>
#include <ctype.h>
#include <stdio.h>
#include <string.h>
#include <stdarg.h>
//#include <assert.h>
#include <limits.h>
#include <stdlib.h>
#include "kernel.h"
#include "sh7750.h"
#include "va300.h"

// 定義

// プロトタイプ宣言

static UH paramMakeSum(void);			///< パラメータのサム作成
static UH makeSum(B *p, int iSize);		///< チェックサム作成

const ST_MCN_PARAM s_cstMcnParam = {
	HEAD_MARK,							///< 値有効マーク
	1000,								///< 受信タイムアウト
	3,									///< 送信リトライ回数
	200,								///< ポーリング間隔(ms)
	60000,								///< 初期登録がないときのタイムアウト時間(ms)
	2000,								///< 自動画面切替時間(ms)
	320,								///< 切り出し開始X座標
	300,								///< 切り出し開始Y座標
	180000,								///< 停電時電源OFF時間(ms)
	1,									///< 端末番号
	
	0x0000								///< チェックサム
};

//=============================================================================
/**
 *	装置パラメータをデフォルト値に設定する
 */
//=============================================================================
void McnParamInit(void)
{
	stMcnParam = s_cstMcnParam;
	stMcnParam.uhChkSum = paramMakeSum();
}

//=============================================================================
/**
 *	受信タイムアウトを取得する
 *	@return タイムアウト時間
 */
//=============================================================================
TMO McnParamRcvTmoutGet(void)
{
	return stMcnParam.tmRcvTmout;
}

//=============================================================================
/**
 *	送信リトライ回数を取得する
 *	@return リトライ回数
 */
//=============================================================================
int McnParamSendRetryGet(void)
{
	return stMcnParam.iSendRetry;
}

//=============================================================================
/**
 *	ポーリング時間を取得する
 *	@return ポーリング時間
 */
//=============================================================================
TMO McnParamPolingGet(void)
{
	return stMcnParam.tmPoling;
}

//=============================================================================
/**
 *	初期登録がないときのタイムアウト時間を取得する
 *	@return タイムアウト時間
 */
//=============================================================================
TMO McnParamFirstTmoutGet(void)
{
	return stMcnParam.tmFirstTmout;
}

//=============================================================================
/**
 *	自動画面切替時間を取得する
 *	@return 自動画面切替時間
 */
//=============================================================================
TMO McnParamLcdDelayGet(void)
{
	return stMcnParam.tmLCDdelay;
}

//=============================================================================
/**
 *	切り出し開始X座標を取得する
 *	@return 切り出し開始X座標
 */
//=============================================================================
int McnParamStartXGet(void)
{
	return stMcnParam.iStartX;
}

//=============================================================================
/**
 *	切り出し開始Y座標を取得する
 *	@return 切り出し開始Y座標
 */
//=============================================================================
int McnParamStartYGet(void)
{
	return stMcnParam.iStartY;
}

//=============================================================================
/**
 *	停電時電源OFF時間を取得する
 *	@return 停電時電源OFF時間
 */
//=============================================================================
TMO McnParamPowerOffGet(void)
{
	return stMcnParam.tmPowOff;
}

//=============================================================================
/**
 *	端末番号を取得する
 *	@return 端末番号
 */
//=============================================================================
enum HOST_TYPE McnParamTermNumberGet(void)
{
	return stMcnParam.eTermNo;
}

//=============================================================================
/**
 * パラメータのサム値を計算
 */
//=============================================================================
static UH paramMakeSum(void)
{
	return makeSum(&(stMcnParam), (sizeof stMcnParam - sizeof stMcnParam.uhChkSum));
}

//=============================================================================
/**
 * パラメータ用サム値を作成
 * @param p ポインタ
 * @param iSize 計算範囲
 * @return サム値
 */
//=============================================================================
static UH makeSum(B *p, int iSize)
{
	UH uhSum;
	
	uhSum = 0;
	
	while(iSize) {
		uhSum += (UH)*p;
		iSize--;
	}
	return uhSum;
}

//=============================================================================
/**
 * パラメータの有効性を確認
 * @return TRUE 有効
 * @return FALSE 無効
 */
//=============================================================================
BOOL IsMcnParamEnable(void)
{
	if (stMcnParam.uwMark == HEAD_MARK) {
		if (paramMakeSum() == stMcnParam.uhChkSum) {
			return TRUE;
		}
	}
	return FALSE;
}
